docs/fileing files/ECF Operations/ReviewFiling/Riverside Superior Court/Subsequent Filing/Substitution of Attorney Inactivate attorney to be Self Rep Sample.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://niem.gov/niem/niem-core/2.0" xmlns:ns10="urn:com.journaltech:ecourt:ecf:extension:ContactValue" xmlns:ns11="urn:com.journaltech:ecourt:ecf:extension:CoreFilingMessageExtType" xmlns:ns12="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentMessage-4.0" xmlns:ns13="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:ns14="urn:com.journaltech:ecourt:ecf:extension:PaymentMessageExt" xmlns:ns15="urn:oasis:names:tc:legalxml-courtfiling:wsdl:WebServicesProfile-Definitions-4.0" xmlns:ns16="com.journaltech.niem.test" xmlns:ns2="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CommonTypes-4.0" xmlns:ns3="http://niem.gov/niem/domains/jxdm/4.0" xmlns:ns4="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CivilCase-4.0" xmlns:ns5="urn:com.journaltech:ecourt:ecf:extension:CivilCaseTypeExt" xmlns:ns6="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CoreFilingMessage-4.0" xmlns:ns7="urn:un:unece:uncefact:data:specification:UnqualifiedDataTypesSchemaModule:2" xmlns:ns8="urn:com.journaltech:ecourt:ecf:extension:DocumentValue" xmlns:ns9="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingMetaData" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <ns15:ReviewFilingRequestMessage>
      <ns2:SendingMDELocationID>
        <ns1:IdentificationID>YOUR_ENDPOINT_HERE</ns1:IdentificationID>
        <ns1:IdentificationSourceText>RSCR</ns1:IdentificationSourceText>
      </ns2:SendingMDELocationID>
      <ns6:CoreFilingMessage xsi:type="ns11:CoreFilingMessageExtType">
        <ns1:DocumentFiledDate id="ref1">
          <ns1:DateTime>2021-04-26T16:41:38-07:00</ns1:DateTime>
        </ns1:DocumentFiledDate>
        <ns1:DocumentIdentification>
          <ns1:IdentificationID>YOUR_IDENTIFICATIONID_HERE</ns1:IdentificationID>
        </ns1:DocumentIdentification>
        <ns1:Case xsi:type="ns5:CivilCaseTypeExt">
          <ns1:CaseDocketID>CASEDOCKETID_HERE</ns1:CaseDocketID>
          <ns5:Complaint xmlns:st="http://niem.gov/niem/structures/2.0" st:id="1063777"/>
          <ns5:CaseAugmentationExt>
            <ns3:CaseCourt>
              <ns1:OrganizationIdentification>
                <ns1:IdentificationID>efm-riv.journaltech.com</ns1:IdentificationID>
                <ns1:IdentificationSourceText>RSCR</ns1:IdentificationSourceText>
              </ns1:OrganizationIdentification>
              <ns3:CourtName>Riverside Superior Court</ns3:CourtName>
            </ns3:CaseCourt>
          </ns5:CaseAugmentationExt>
        </ns1:Case>
        <ns6:FilingLeadDocument xmlns:st="http://niem.gov/niem/structures/2.0" complaintType="1063777" st:id="doc0" xsi:type="ns11:DocumentExtType">
          <ns1:DocumentBinary>
            <ns1:BinaryFormatStandardName xsi:type="ns7:TextType">application/pdf</ns1:BinaryFormatStandardName>
            <ns1:BinaryLocationURI>YOUR_URL_HERE</ns1:BinaryLocationURI>
          </ns1:DocumentBinary>
          <ns1:DocumentDescriptionText>SA</ns1:DocumentDescriptionText>
          <ns1:DocumentFileControlID>7626</ns1:DocumentFileControlID>
          <ns1:DocumentIdentification>
            <ns1:IdentificationID>SA</ns1:IdentificationID>
            <ns1:IdentificationSourceText>RSCR</ns1:IdentificationSourceText>
          </ns1:DocumentIdentification>
          <ns9:DocumentFilingMetaData>
            <ns9:documentFilingMetaDataItem>
              <ns9:docValueMetaDataItem>
                <ns8:code>FILED_BY</ns8:code>
                <ns8:classType>caseParticipant</ns8:classType>
                <ns8:subType>filed-by</ns8:subType>
                <ns8:valueRestriction>existing-data</ns8:valueRestriction>
              </ns9:docValueMetaDataItem>
              <ns9:idReferences>
                <ns9:id>3799000</ns9:id>
              </ns9:idReferences>
            </ns9:documentFilingMetaDataItem>
            <ns9:documentFilingMetaDataItem>
              <ns9:docValueMetaDataItem>
                <ns8:code>REPLACE_ATTORNEY</ns8:code>
                <ns8:classType>attorney</ns8:classType>
                <ns8:subType>filed-by</ns8:subType>
                <ns8:valueRestriction>existing-data</ns8:valueRestriction>
              </ns9:docValueMetaDataItem>
              <ns9:idReferences>
                <ns9:id>3798999</ns9:id>
              </ns9:idReferences>
            </ns9:documentFilingMetaDataItem>
            <ns9:documentFilingMetaDataItem>
              <ns9:docValueMetaDataItem>
                <ns8:code>IS_SELF_REP</ns8:code>
                <ns8:classType>boolean</ns8:classType>
              </ns9:docValueMetaDataItem>
              <ns9:booleanValue>true</ns9:booleanValue>
            </ns9:documentFilingMetaDataItem>
            <ns9:documentFilingMetaDataItem>
              <ns9:docValueMetaDataItem>
                <ns8:code>SELF_REP_ADDRESS</ns8:code>
                <ns8:classType>contact</ns8:classType>
              </ns9:docValueMetaDataItem>
              <ns9:contactValue>
                <ns10:address1>56 Jackson Avenue</ns10:address1>
                <ns10:city>Riverside</ns10:city>
                <ns10:zip>92501</ns10:zip>
                <ns10:state>CA</ns10:state>
                <ns10:country>US</ns10:country>
                <ns10:telephoneType>W</ns10:telephoneType>
                <ns10:email>test@email.com</ns10:email>
                <ns10:addressType>HA</ns10:addressType>
              </ns9:contactValue>
            </ns9:documentFilingMetaDataItem>
          </ns9:DocumentFilingMetaData>
        </ns6:FilingLeadDocument>
      </ns6:CoreFilingMessage>
      <ns12:PaymentMessage xsi:type="ns14:PaymentMessageTypeExt">
        <ns14:paymentAuthorizationInfo>
          <ns14:customerProfileId>0</ns14:customerProfileId>
          <ns14:customerPaymentProfileId>0</ns14:customerPaymentProfileId>
          <ns14:paymentType>ACH</ns14:paymentType>
        </ns14:paymentAuthorizationInfo>
      </ns12:PaymentMessage>
    </ns15:ReviewFilingRequestMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>